{
  "add_cross_attention": false,
  "architectures": [
    "CsmForConditionalGeneration"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "audio_eos_token_id": 128003,
  "audio_num_codebooks": 32,
  "audio_token_id": 128002,
  "audio_vocab_size": 2051,
  "backbone_flavor": "llama-250M",
  "bos_token_id": 128000,
  "chunk_size_feed_forward": 0,
  "codebook_eos_token_id": 0,
  "codebook_pad_token_id": 2050,
  "codec_config": {
    "sampling_rate": 24000,
    "audio_channels": 1,
    "hidden_size": 512,
    "num_filters": 64,
    "num_residual_layers": 1,
    "upsampling_ratios": [
      8,
      6,
      5,
      4
    ],
    "kernel_size": 7,
    "last_kernel_size": 3,
    "residual_kernel_size": 3,
    "dilation_growth_rate": 2,
    "use_causal_conv": true,
    "pad_mode": "constant",
    "compress": 2,
    "trim_right_ratio": 1.0,
    "codebook_size": 2048,
    "codebook_dim": 256,
    "num_quantizers": 32,
    "use_conv_shortcut": false,
    "vector_quantization_hidden_dimension": 256,
    "upsample_groups": 512,
    "num_hidden_layers": 8,
    "intermediate_size": 2048,
    "num_attention_heads": 8,
    "num_key_value_heads": 8,
    "hidden_act": "gelu",
    "max_position_embeddings": 8000,
    "initializer_range": 0.02,
    "norm_eps": 1e-05,
    "use_cache": false,
    "use_streaming": false,
    "sliding_window": 250,
    "attention_dropout": 0.0,
    "head_dim": 64,
    "layer_scale_initial_scale": 0.01,
    "attention_bias": false,
    "rope_parameters": {
      "rope_type": "default",
      "rope_theta": 10000.0
    },
    "_frame_rate": 12.5,
    "num_semantic_quantizers": 1,
    "return_dict": true,
    "output_hidden_states": false,
    "dtype": "float32",
    "tie_word_embeddings": true,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "architectures": [
      "MimiModel"
    ],
    "finetuning_task": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "task_specific_params": null,
    "problem_type": null,
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": null,
    "pad_token_id": null,
    "eos_token_id": null,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "_name_or_path": "kyutai/mimi",
    "normalize": false,
    "rope_theta": 10000.0,
    "model_type": "mimi",
    "output_attentions": false,
    "rope_scaling": {
      "type": "linear",
      "factor": 1.0
    }
  },
  "cross_attention_hidden_size": null,
  "decoder_flavor": "llama-60M",
  "decoder_start_token_id": null,
  "depth_decoder_config": {
    "return_dict": true,
    "output_hidden_states": false,
    "dtype": null,
    "tie_word_embeddings": false,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "architectures": null,
    "finetuning_task": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "task_specific_params": null,
    "problem_type": null,
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": null,
    "pad_token_id": null,
    "eos_token_id": null,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "_name_or_path": "",
    "model_type": "csm_depth_decoder_model",
    "rope_parameters": {
      "factor": 32.0,
      "high_freq_factor": 0.0078125,
      "low_freq_factor": 0.001953125,
      "original_max_position_embeddings": 16,
      "rope_type": "llama3",
      "rope_theta": 500000
    },
    "rope_theta": 500000,
    "num_codebooks": 32,
    "vocab_size": 2051,
    "backbone_hidden_size": 1536,
    "max_position_embeddings": 33,
    "hidden_size": 1024,
    "intermediate_size": 4096,
    "num_hidden_layers": 4,
    "num_attention_heads": 8,
    "num_key_value_heads": 2,
    "hidden_act": "silu",
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-05,
    "use_cache": true,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "mlp_bias": false,
    "head_dim": 128,
    "output_attentions": false,
    "rope_scaling": {
      "type": "linear",
      "factor": 1.0
    }
  },
  "dtype": null,
  "eos_token_id": null,
  "finetuning_task": null,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 1536,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "initializer_range": 0.02,
  "intermediate_size": 8192,
  "is_decoder": false,
  "is_encoder_decoder": false,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "max_position_embeddings": 2048,
  "mlp_bias": false,
  "model_type": "sesame",
  "num_attention_heads": 12,
  "num_codebooks": 32,
  "num_hidden_layers": 6,
  "num_key_value_heads": 3,
  "output_attentions": false,
  "output_hidden_states": false,
  "pad_token_id": 128002,
  "prefix": null,
  "problem_type": null,
  "quantization": {
    "group_size": 64,
    "bits": 4,
    "mode": "affine"
  },
  "quantization_config": {
    "group_size": 64,
    "bits": 4,
    "mode": "affine"
  },
  "return_dict": true,
  "rms_norm_eps": 1e-05,
  "rope_parameters": {
    "factor": 32.0,
    "high_freq_factor": 0.5,
    "low_freq_factor": 0.125,
    "original_max_position_embeddings": 1024,
    "rope_type": "llama3",
    "rope_theta": 500000
  },
  "rope_theta": 500000,
  "sep_token_id": null,
  "task_specific_params": null,
  "text_tokenizer": "Marvis-AI/marvis-tts-250m-v0.2",
  "text_vocab_size": 49152,
  "tie_codebooks_embeddings": true,
  "tie_encoder_decoder": false,
  "tie_word_embeddings": false,
  "tokenizer_class": null,
  "transformers_version": "5.0.0.dev0",
  "use_cache": true,
  "vocab_size": 2051,
  "rope_scaling": {
    "type": "linear",
    "factor": 1.0
  }
}